ЗАДАНИЯ 2 ЛВЛа
Задание №2
Найти массу шара. Радиус шара вводиться в консоль ( радиус имеет тип double). Плотность шара = 21500 кг/м^3
Даны формулы:
V = (4/3) * pi * R^3
P = m / V
Вывести массу округлив ее до целого числа математически верно.
Примечание:
Использовать константу M_PI, и функцию double round(double) из библиотеки math.h
Вывод должен выглядеть так:
printf("%.0lf", result) ;

Задание №2
Написать программу, осуществляющую перестановку крайних цифр в целом трехзначном числе. Целое трёхзначное число задаётся на стандартном потоке stdin, результат перестановки выводить в виде трёхзначного числа с учётом ведущих нулей на стандартный поток вывода stdout. В конце ответа не должно быть переноса.
вход: 159 результат: 951
вход: 120 результат: 021
вход: -123 результат: -321

Задание №2
ввод не ограничен количеством целых чисел
на вывод: произведение нечетных чисел, если всего 2 числа  - выводить ноль, если одно число - вывести его (но положительным)
ввод 	  | вывод
--------------------
1 2 3 4   | 3
--------------------
2 4         | 0
--------------------
-3    	   | 3

Задание №2
Поступают числа x, y и z каждое из которых может принимать одно из двух значений (0 и 1). Нужно вывести единицу, если значение следующего выражения истинно: x and (z or y), в противном случае вывести 0. В конце ответа не должно быть переноса на новую строку. Проверить на ввод 1 и 0, в случае ошибки вывести "n/a".
входные данные: 111 результат: 1
вход: 000 результат: 0

Задание №2
Дана последовательность целых чисел Число n Символ конца -1 Вывести x1 xn x2 xn-1 x3 xn-2 и так далее


ЗАДАНИЯ 3 ЛВЛа
Задание №3
Найти и удалить последнее вхождение подстроки
То есть даются 2 строки:
This is mytext
my
Вывод должен был быть
This is text

Задание №3 После того как не выполнил предыдущее
Дают число 123
Найти наибольшую цифру, то есть 3
----------
11111
1
—————.0.x
18
8
-----------

Задание №3
Дается натуральное число  Даются данные для заполнения Н структур  Структура состоит из имени (str) фамилия (str) рост int
После дается 1 положительное целое число и нужно вывести в строчку через запятую фамилии и имена чей рост выше какого то значения

Задание №3 На вход подается последовательность из чисел которая заканчивается -1 Задача - поменять местами первый появляющийся в последовательности наибольший и наименьший элемент из целых неотрицательных чисел
Проверить валидность данных

Задание №3
Считать 3 int из STDIN, вычислить логическое выражение. В зависимости от его значения сделать print 0/1. Запрещено использовать if для всего, кроме проверки валидности инпута. Решил через тернарник

Задание №3
проверить является ли строка палиндромом (строка должна заканчиваться \n)
входная строка может содержать буквы латинского алфавита и цифры, длина строки до 100 символов
ввод        	| вывод
------------------------
Mam mam  | YES
------------------------
Test1       	| NO

Задание №3 Дана последовательность положительных целых чисел, если -1, то конец строки.
Input : 123 Output: 132; 
input: 123456 Output: 162534

Задание №3
В неограниченной последовательности терминус -1 найти повторяющиеся числа и записать в последовательности их появления.
(На маллок-реаллок работающее решение без защиты от ошибки аллокации не принялось)

Задание №3
На вход поступает последовательность из целых неотрицательных чисел где -1 это конец последовательности. Найти 2 числа max и min в данной последовательности, поменять их местами и вывести уже измененную последовательность. В случае любой ошибки n/a. После конца(-1) не должно быть никаких символов. Не забыть освободить выделенную память.
Пример:
Input :    7 4 6 1 2 6 3 9 4 3 -1
Output:  7 4 6 9 2 6 3 1 4 3
З.ы. Трижды скипнув появлялось это задание 


ЗАДАНИЯ 4 ЛВЛа
Задание №4.
Дана строка вида:
"   test   sample test	text"
"    	text"
"            	t 	"
Каждая строка завершается символом '\n'
Убрать лишние пробелы в начале и в конце строки. Между словами оставить 1 пробел.
В результате строка должна быть следующего вида:
"test sample test text"
Сделал через бесконечный цикл, который работает, пока не встретит \n. С пробелами разобрался с помощью флагов.

Задание №4:
Создать структуру с именем студента, фамилией и ростом. Первым даётся количество студентов, затем имя, фамилия и рост по порядку, каждое с новой строки. После этого вводится рост, в зависимости от которого нужно вывести результат в виде "Имя, фамилия" всех тех людей, рост которых >=

Задание №4.
Создать структуру с фамилией студента (строка, гарантируется, что при вводе длина не превосходит 20 символов) и баллом за семестр (целое число). Заполнить массив из n элементов структуры. Элементы вводятся последовательно, построчно, на конце ‘\n’.
Вычислить средний балл студентов и вывести через запятую фамилии тех, чей балл выше среднего. Если таких студентов нет, то вывести No matches.


Задание №4 На вход подается два инта - размер матрицы m x n
Задача повернуть матрицу на 90 градусов
2 3 1 1 1 2  2 2  3 3 3    output  1 2 3 1 2 3 1 2 3

Задание №4
Перемножить квадратные матрицы n порядка.
Ввод: n, квадратная матрица n порядка, квадратная матрица n порядка
Вывод: матрица результат произведения
Формула перемножения ij элемента матрицы в общем виде дана

ЗАДАНИЯ 5 ЛВЛа
Задание 5.
Создать структуру Vector с тремя int полями - x, y, z. Заполнить массив этими структурами. Длина массива дается в STDIN первым числом. Далее в STDIN дается информация для самих векторов. Затем нужно произвести несложные вычисления по заданной формуле. В конце не забыть почистить память, выделенную под массив маллоком

Задание №5 Змейка с прошлого экзамена.
На вход дается n, вывести матрицу n*n заполненную по спирали (там есть вариант заполнения от 1 до n и есть вариант заполнения от 0 до n*n)



 НЕ ЗНАЮ КАКОЙ ЛВЛ НО 2-5 точно

Exam 04.02
Найти и вывести max последовательности терминус -1
1 2 3 4 -1
Exam 05.01
Вывести скалярное произведение 2-х векторов
Input = 1	7 	3
Output = 21
Input2 = 3   1 2 3   1 2 3
Output = 14
Exam 06.02
Сделать swapping rows n-матрицы
Поменять местами ряды с min/max значениями в первом ряду;
Exam 06.05
Заварить квадратную матрицу n-размера обратной змейкой с наклоном в 90 градусов.
Ячейки заполнять квадратом инкремента +1;
Exam 07.03
Сплит лишних пробелов в строке. В начала и в конце - нет пробелов.
В середине только по одному пробелу.
Закончить '\n' по-моему, но не помню точно;
Exam 08.02
Структуры Students
Собирать из stdin в структуры: last_name и grade и среднюю оценку
Потом выводить last_name.
