1. Мои поздравления.
2. *имитация сарказма* Первую комнату ты почти закончил.
3. Для начала, ты должен запомнить, вся работа должна вестись только на
ветке develop! Создааай же ее, перенеся туда все изменения!
4. Чтобы открыть дверь, создай от develop новую ветку key-branch. Убедись, что в ней присутствует ключ main.key
5. Создай копию ключа (main-2.key) и зафиксируй изменения
6. Создай ветку от key-branch и назови ее feature/3-key
7. Создай вторую копию ключа (main-3.key) в ветке feature/3-key 
8. Зафиксируй изменения. Не забудь оставить название ветки в начале комментария к коммиту.
> "Не задавай вопросов, почему. Программисты всегда говорили что это важно: я и привык."
9. Подлей изменения из feature/3-key в key-branch
10. Создай ветку release/1.0 от develop ветки
II. Подлей последовательно key-branch в develop и develop в release/1.0.
